Tasks/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Task>
		<Properties>
			<Name>Задача</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тэги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/НазначениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НазначениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Задача/Forms/ФормаЗадачи/Ext/Form/Module.bsl
#Область ДействияФормы     

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшТэгов();
	СформироватьГиперссылкиФайловНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Выполнена Тогда
		Элементы.ФормаВыполнитьИЗакрыть.Доступность = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСтрокуПрикреплений" Тогда
		СформироватьГиперссылкиФайловНаФорме();
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти  


&НаСервере
Процедура ЗаполнитьКэшТэгов() 
	
	КэшТэгов.Очистить();
	МасТэговЭтойЗадачи = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.Тэги, ",");
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Задача.Тэги КАК Тэги
	             |ИЗ
	             |	Задача.Задача КАК Задача
	             |ГДЕ
	             |	Задача.Тэги <> """"
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Тэги";
    Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Тэги, ",");
		Для каждого Эл Из мас Цикл
			тэг = СокрЛП(Эл);
			Если КэшТэгов.НайтиПоЗначению(тэг) = Неопределено Тогда
				КэшТэгов.Добавить(тэг, тэг, МасТэговЭтойЗадачи.Найти(тэг) <> Неопределено);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
              	
КонецПроцедуры	

&НаКлиенте
Процедура ТэгиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ВыбратьИзСписка(КэшТэгов, Элементы.Тэги);

    Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	КэшТэгов.ПоказатьОтметкуЭлементов(Оповещение, "Тэги");

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Список, Параметры) Экспорт 
	
	Если Список <> Неопределено Тогда
		Объект.Тэги = "";
        Для каждого Элемент из Список Цикл
			Если Элемент.Пометка Тогда 
				Если Объект.Тэги <> "" Тогда
					Объект.Тэги = Объект.Тэги + ", ";
				КонецЕсли; 
				Объект.Тэги = Объект.Тэги + Элемент.Значение;
            КонецЕсли;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры



#Область РаботаСФайлами 

//+++               

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаКлиенте
Процедура НажатиеГиперссылкиФайлаОплаты(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																Перечисления.НазначениеФайлов.Прочее, 
																"НажатиеГиперссылкиФайла");

КонецПроцедуры

//---

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СтандартнаяОбработка = Ложь;
	НажатиеГиперссылкиФайла(Неопределено, СтандартнаяОбработка) 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Задача еще не записана. Записать задачу и прикрепить файл?'; en = 'Задача еще не записана. Записать задачу и прикрепить файл?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	//ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ВладелецФормы.Объект.Ссылка, Параметр,л_Отказ,,л_КлючЗаписи,л_Сообщение);
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры 

#КонецОбласти
